nc: 9
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, DyConv, [64, 3, 2]]
  - [-1, 1, DyConv, [128, 3, 2]]
  - [-1, 3, C2f_ECA, [128, True]]
  - [-1, 1, DyConv, [256, 3, 2]]
  - [-1, 6, C2f_ECA, [256, True]]
  - [-1, 1, DyConv, [512, 3, 2]]
  - [-1, 6, C2f_ECA, [512, True]]
  - [-1, 1, DyConv, [1024, 3, 2]]
  - [-1, 3, C2f_ECA, [1024, True]]
  - [-1, 1, SPPF_Enhanced, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f_ECA, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f_ECA, [256]]
  - [-1, 1, DyConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f_ECA, [512]]
  - [-1, 1, DyConv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f_ECA, [1024]]
  - [[15, 18, 21], 1, Detect, [nc]]